armor66/ESP32-S3-Handset/4.0.0-S3-xLite/src/tx_main.cpp
#include "rxtx_common.h"

#include "CRSFHandset.h"
#include "CRSFParameters.h"
#include "dynpower.h"
#include "msp.h"
#include "msptypes.h"
#include "stubborn_receiver.h"
#include "stubborn_sender.h"

#include "devHandset.h"
#include "devADC.h"
#include "devAnalogVbat.h"  //my@
#include "devEncoder.h"     //my@
#include "devLED.h"
#include "devTXLUA.h"
#include "devWIFI.h"
#include "devButton.h"
#include "devVTX.h"
//my@ #if defined(PLATFORM_ESP32)
#include "devScreen.h"
#include "devBLE.h"
#include "devGsensor.h"
#include "devThermal.h"
#include "devPDET.h"
#include "devBackpack.h"
//my@ #else
// // Fake functions for 8285
// void checkBackpackUpdate() {}
// void sendCRSFTelemetryToBackpack(uint8_t *) {}
// void sendMAVLinkTelemetryToBackpack(uint8_t *) {}
// #endif

#include "CRSFParser.h"
#include "CRSFRouter.h"
#include "MAVLink.h"
#include "TXModuleEndpoint.h"
#include "TXOTAConnector.h"
#include "TXUSBConnector.h"

// #if defined(PLATFORM_ESP8266)
// #include <user_interface.h>
// #endif

/// define some libs to use ///
MSP msp;
ELRS_EEPROM eeprom;
TxConfig config;
Stream *TxUSB;

// Variables / constants for Airport //
FIFO<AP_MAX_BUF_LEN> apInputBuffer;
FIFO<AP_MAX_BUF_LEN> apOutputBuffer;

#define UART_INPUT_BUF_LEN 1024
FIFO<UART_INPUT_BUF_LEN> uartInputBuffer;

uint8_t mavlinkSSBuffer[CRSF_MAX_PACKET_LEN]; // Buffer for current stubbon sender packet (mavlink only)

unsigned long rebootTime = 0;
extern bool webserverPreventAutoStart;
//// MSP Data Handling ///////
bool NextPacketIsDataUl = false;  // if true the next packet will contain the uplink data (instead of channels)
char backpackVersion[32] = "";

////////////SYNC PACKET/////////
/// sync packet spamming on mode change vars ///
#define syncSpamAmount 3
#define syncSpamAmountAfterRateChange 10
volatile uint8_t syncSpamCounter = 0;
volatile uint8_t syncSpamCounterAfterRateChange = 0;
uint32_t rfModeLastChangedMS = 0;
uint32_t SyncPacketLastSent = 0;
static enum { stbIdle, stbRequested, stbBoosting } syncTelemBoostState = stbIdle;
////////////////////////////////////////////////

static uint32_t LastTLMpacketRecv_Ms = 0;
static uint32_t LinkStatsLastReported_Ms = 0;  //uart@
static bool commitInProgress = false;

LQCALC<100> LqTQly;

volatile bool busyTransmitting;
static volatile bool ModelUpdatePending;

uint8_t MSPDataPackage[5];
#define BindingSpamAmount 25
static uint8_t BindingSendCount;
bool RxWiFiReadyToSend = false;

static TxTlmRcvPhase_e TelemetryRcvPhase = ttrpTransmitting;
StubbornReceiver DataDlReceiver;
StubbornSender DataUlSender;
uint8_t CRSFinBuffer[CRSF_MAX_PACKET_LEN+1];

CRSFRouter crsfRouter;
TXModuleEndpoint crsfTransmitter;
TXOTAConnector otaConnector;
TXUSBConnector usbConnector;
CRSFParser crsfParser;

//my@ variables
uint8_t airBat_Val = 0;
bool isRXconnected = false;
bool mspTransferActive = false;   //moved from "loop"
char flightMode[8] = {0};
int32_t latitude;
int32_t longitude;
int16_t speed;
uint8_t sats;
bool modelChanged = false;        //extern in common.h
uint32_t TLMpacketReported = 0;
uint8_t *p_tlmBuff = CRSFinBuffer;

device_affinity_t ui_devices[] = {
  {&Handset_device, 1},
  //my@ {&LED_device, 0},
  //my@ {&RGB_device, 0},
  // {&TXLUA_device, 1},
  {&ADC_device, 1},
  {&AnalogVbat_device, 1},
  {&Encoder_device, 0},
  {&WIFI_device, 0},
  //my@ {&Button_device, 0},
//my@ #if defined(PLATFORM_ESP32)
  {&Backpack_device, 0},
  {&BLE_device, 0},
// #if !defined(PLATFORM_ESP32_C3)
  {&Screen_device, 0},
  //my@ {&Gsensor_device, 0},
  //my@ {&Thermal_device, 0},
  //my@ {&PDET_device, 0},
// #endif
//my@ #endif
  {&VTX_device, 0}
};

static bool diversityAntennaState = LOW;

static bool inGeminiMode()
{
    return isDualRadio() && config.GetAntennaMode() == TX_RADIO_MODE_GEMINI;
}

void switchDiversityAntennas()
{
  if (GPIO_PIN_ANT_CTRL != UNDEF_PIN)
  {
    diversityAntennaState = !diversityAntennaState;
    digitalWrite(GPIO_PIN_ANT_CTRL, diversityAntennaState);
  }
  if (GPIO_PIN_ANT_CTRL_COMPL != UNDEF_PIN)
  {
    digitalWrite(GPIO_PIN_ANT_CTRL_COMPL, !diversityAntennaState);
  }
}

void ICACHE_RAM_ATTR LinkStatsFromOta(OTA_LinkStats_s * const ls)
{
  int8_t snrScaled = ls->SNR;
  DynamicPower_TelemetryUpdate(snrScaled);

  // Antenna is the high bit in the RSSI_1 value
  // RSSI received is signed, inverted polarity (positive value = -dBm)
  // OpenTX's value is signed and will display +dBm and -dBm properly
  linkStats.uplink_RSSI_1 = -(ls->uplink_RSSI_1);
  linkStats.uplink_RSSI_2 = -(ls->uplink_RSSI_2);
  linkStats.uplink_Link_quality = ls->lq;
#if defined(DEBUG_FREQ_CORRECTION)
  // Don't descale the FreqCorrection value being send in SNR
  linkStats.uplink_SNR = snrScaled;
#else
  linkStats.uplink_SNR = SNR_DESCALE(snrScaled);
#endif
  linkStats.active_antenna = ls->antenna;
  connectionHasModelMatch = ls->modelMatch;
  // -- downlink_SNR / downlink_RSSI is updated for any packet received, not just Linkstats
  // -- uplink_TX_Power is updated when sending to the handset, so it updates when missing telemetry
  // -- rf_mode is updated when we change rates
  // -- downlink_Link_quality is updated before the LQ period is incremented

  // The Rx only has a single radio.  Force the Tx out of Gemini mode.
  if (inGeminiMode() && !ls->trueDiversityAvailable)
  {
      config.SetAntennaMode(TX_RADIO_MODE_SWITCH);
  }
}

/***
 * @brief Receive downlink data from payload buffers in OTA_Packet_s structures and merge Gemini payload buffers
 * @param pi1 packageIndex from Radio.RXdataBuffer
 * @param pi2 packageIndex from Radio.RXdataBufferSecond (not used if not Gemini)
 * @param data1 pointer to payload from Radio.RXdataBuffer
 * @param data2 pointer to payload from Radio.RXdataBufferSecond (not used if not Gemini)
 * @param dataLen sizeof payload data in both data1 and data2
 * @param stubbornAck StubbornSender ack bit from either buffer (should be same)
 */
void ICACHE_RAM_ATTR ProcessOtaDataDl(uint8_t pi1, uint8_t pi2, uint8_t *data1, uint8_t *data2, size_t dataLen, bool stubbornAck)
{
  static uint8_t packageIndexRadio1 = 0xFF;
  static uint8_t packageIndexRadio2 = 0xFF;
  constexpr size_t geminiSpanBufferSize = 2 * ELRS8_DATA_DL_BYTES_PER_CALL; // 2 * whatever the largest payload will be
  static uint8_t geminiSpanBuffer[geminiSpanBufferSize] = {0};

  // Gemini downlink data transfer uses both radios to double to downlink data instead of being redundant copies
  // Build the "span" buffer from the two downlink packet buffers as the two halves come in
  if (inGeminiMode())
  {
      if (Radio.GetProcessingPacketRadio() == SX12XX_Radio_1)
      {
          packageIndexRadio1 = pi1;
          memcpy(geminiSpanBuffer, data1, dataLen);
      }
      else
      {
          packageIndexRadio2 = pi1;
          memcpy(&geminiSpanBuffer[dataLen], data1, dataLen);
      }

