armor66/ESP32-S3-Handset/4.0.0-S3-xLite/src/tx_main.cpp
static void EnterBindingMode()
{
  if (InBindingMode)
      return;

  // Disable the TX timer and wait for any TX to complete
  hwTimer::stop();
  while (busyTransmitting);

  // Queue up sending the Master UID as MSP packets
  SendUIDOverMSP();

  // Binding uses 50Hz, and InvertIQ
  OtaCrcInitializer = OTA_VERSION_ID;
  OtaNonce = 0; // Lock the OtaNonce to prevent syncspam packets
  InBindingMode = true; // Set binding mode before SetRFLinkRate() for correct IQ

  // Start attempting to bind
  // Lock the RF rate and freq while binding
  SetRFLinkRate(enumRatetoIndex(RATE_BINDING));

  // Start transmitting again
  hwTimer::resume();

  DBGLN("Entered binding mode at freq = %d", Radio.currFreq);
}

static void ExitBindingMode()
{
  if (!InBindingMode)
    return;

  DataUlSender.ResetState();

  // Reset CRCInit to UID-defined value
  OtaUpdateCrcInitFromUid();
  InBindingMode = false; // Clear binding mode before SetRFLinkRate() for correct IQ

  UARTconnected();

  SetRFLinkRate(config.GetRate()); //return to original rate

  DBGLN("Exiting binding mode");
}

void EnterBindingModeSafely()
{
  // TX can always enter binding mode safely as the function handles stopping the transmitter
  EnterBindingMode();
}

void ProcessMSPPacket(uint32_t now, mspPacket_t *packet)
{
#if defined(PLATFORM_ESP32)
  // Inspect packet for ELRS specific opcodes
  if (packet->function == MSP_ELRS_FUNC)
  {
    uint8_t opcode = packet->readByte();

    CHECK_PACKET_PARSING();

    switch (opcode)
    {
    case MSP_ELRS_POWER_CALI_GET:
      OnPowerGetCalibration(packet);
      break;
    case MSP_ELRS_POWER_CALI_SET:
      OnPowerSetCalibration(packet);
      break;
    default:
      break;
    }
  }
  else if (packet->function == MSP_SET_VTX_CONFIG)
  {
    if (packet->payload[0] < 48) // Standard 48 channel VTx table size e.g. A, B, E, F, R, L
    {
      config.SetVtxBand(packet->payload[0] / 8 + 1);
      config.SetVtxChannel(packet->payload[0] % 8);
    } else
    {
      return; // Packets containing frequency in MHz are not yet supported.
    }

    VtxTriggerSend();
  }
  else if (packet->function == MSP_ELRS_BACKPACK_SET_PTR)
  {
    processPanTiltRollPacket(now, packet);
  }
  if (packet->function == MSP_ELRS_GET_BACKPACK_VERSION)
  {
    memset(backpackVersion, 0, sizeof(backpackVersion));
    memcpy(backpackVersion, packet->payload, min((size_t)packet->payloadSize, sizeof(backpackVersion)-1));
  }
#endif
}

void ParseMSPData(uint8_t *buf, uint8_t size)
{
  for (uint8_t i = 0; i < size; ++i)
  {
    if (msp.processReceivedByte(buf[i]))
    {
      ProcessMSPPacket(millis(), msp.getReceivedPacket());
      msp.markPacketReceived();
    }
  }
}

// static void HandleUARTout()
// {
//   if (firmwareOptions.is_airport)
//   {
//     auto size = apOutputBuffer.size();
//     if (size)
//     {
//       uint8_t buf[size];
//       apOutputBuffer.lock();
//       apOutputBuffer.popBytes(buf, size);
//       apOutputBuffer.unlock();
//       TxUSB->write(buf, size);
//     }
//   }
// }

// static void HandleUARTin()
// {
//   if (firmwareOptions.is_airport)
//   {
//     auto size = std::min(apInputBuffer.free(), (uint16_t)TxUSB->available());
//     if (size > 0)
//     {
//       uint8_t buf[size];
//       TxUSB->readBytes(buf, size);
//       apInputBuffer.lock();
//       apInputBuffer.pushBytes(buf, size);
//       apInputBuffer.unlock();
//     }
//     return;
//   }

//   // USB serial input
//   // If a mavlink packet is received on the USB input, automatically switch the link mode to and process as mavlink
//   // Otherwise, USB serial data is processed as CRSF
//   auto size = std::min(uartInputBuffer.free(), (uint16_t)TxUSB->available());
//   if (size > 0)
//   {
//     uint8_t buf[size];
//     TxUSB->readBytes(buf, size);

//     // If the data is MAVLink, then auto change LinkMode and start the radio link
//     // since the user might be operating the module as a standalone unit without a handset.
//     if (connectionState == noCrossfire)
//     {
//       if (isThisAMavPacket(buf, size))
//       {
//         config.SetLinkMode(TX_MAVLINK_MODE);
//         UARTconnected();
//       }
//     }
//     if (config.GetLinkMode() == TX_MAVLINK_MODE)
//     {
//       uartInputBuffer.lock();
//       uartInputBuffer.pushBytes(buf, size);
//       uartInputBuffer.unlock();
//     }
//     else
//     {
//       crsfParser.processBytes(&usbConnector, buf, size);
//     }
//   }

//   // Backpack serial input
//   // Backpack will not switch modes, but will process data as mavlink if the link mode is already set to mavlink
//   // Backpack serial data is ALSO always processed as backpack MSP
//   if (BackpackOrLogStrm != TxUSB && BackpackOrLogStrm->available())
//   {
//     auto size = std::min(uartInputBuffer.free(), (uint16_t)BackpackOrLogStrm->available());
//     if (size > 0)
//     {
//       uint8_t buf[size];
//       BackpackOrLogStrm->readBytes(buf, size);

//       // If the TX is in Mavlink mode, push the bytes into the fifo buffer
//       if (config.GetLinkMode() == TX_MAVLINK_MODE)
//       {
//         uartInputBuffer.lock();
//         uartInputBuffer.pushBytes(buf, size);
//         uartInputBuffer.unlock();

//         // The TX is in MAVLink mode and receiving data from the Backpack,
//         // start the radio since the user might be operating the module as a standalone unit without a handset.
//         if (connectionState == noCrossfire)
//         {
//           if (isThisAMavPacket(buf, size))
//           {
//             UARTconnected();
//           }
//         }
//       }

//       // Try to parse any MSP packets from the Backpack
//       ParseMSPData(buf, size);
//     }
//   }

//   if (config.GetLinkMode() == TX_MAVLINK_MODE)
//   {
//     // Use DataUlSender for MAVLINK uplink data
//     uint8_t *nextPayload = 0;
//     uint8_t nextPlayloadSize = 0;
//     uint16_t count = uartInputBuffer.size();
//     if (count > 0 && !DataUlSender.IsActive())
//     {
//       count = std::min(count, (uint16_t)CRSF_PAYLOAD_SIZE_MAX);
//       mavlinkSSBuffer[0] = MSP_ELRS_MAVLINK_TLM; // Used on RX to differentiate between std msp opcodes and mavlink
//       mavlinkSSBuffer[1] = count;
//       // Following n bytes are just raw mavlink
//       uartInputBuffer.lock();
//       uartInputBuffer.popBytes(mavlinkSSBuffer + CRSF_FRAME_NOT_COUNTED_BYTES, count);
//       uartInputBuffer.unlock();
//       nextPayload = mavlinkSSBuffer;
//       nextPlayloadSize = count + CRSF_FRAME_NOT_COUNTED_BYTES;
//       DataUlSender.SetDataToTransmit(nextPayload, nextPlayloadSize);
//     }
//   }
// }

static void setupSerial()
{  /*
   * Setup the logging/backpack serial port, and the USB serial port.
   * This is always done because we need a place to send data even if there is no backpack!
   */

// Setup BackpackOrLogStrm
#if defined(PLATFORM_ESP32)
  Stream *serialPort;

