armor66/ESP32-S3-Handset/4.0.0-S3-xLite/src/tx_main.cpp
      // Set the pkt rate, TLM ratio, and power from the stored eeprom values
      ChangeRadioParams();

      LbtCcaTimerStart();
      hwTimer::init(nullptr, timerCallback);
      setConnectionState(noCrossfire);
    }
  }
  else
  {
    // In the failure case we set the logging to the null logger so nothing crashes
    // if it decides to log something
    BackpackOrLogStrm = new NullStream();
    TxUSB = BackpackOrLogStrm;
  }

  registerButtonFunction(ACTION_BIND, EnterBindingMode);
  registerButtonFunction(ACTION_INCREASE_POWER, cyclePower);

  devicesStart();

  if (firmwareOptions.is_airport)
  {
    config.SetTlm(TLM_RATIO_1_2); // Force TLM ratio of 1:2 for balanced bi-dir link
    config.SetMotionMode(0); // Ensure motion detection is off
    UARTconnected();
  }

  UARTconnected(); //my@new just pretend to execute it
//  BackpackTelemReadyToSend = true;  //bp@ send once (devBackpack.cpp)
}

#include "crsf_protocol.h"

void loop()
{
  uint32_t now = millis();

  // HandleUARTout(); // Only used for non-CRSF output

  #if defined(USE_BLE_JOYSTICK)
  if (connectionState != bleJoystick && connectionState != noCrossfire) // Wait until the correct crsf baud has been found
  {
      connectionState = bleJoystick;
  }
  #endif

  if (connectionState < MODE_STATES)
  {
    UpdateConnectDisconnectStatus();
  }

  // Update UI devices
  // devicesUpdate(now);
/*my@new to prevent abrupt halt when wifiUpdate or move it after >MODE_STATES clause*/
  if(connectionState != wifiUpdate) devicesUpdate(now);

  // Not a device because it must be run on the loop core
  // checkBackpackUpdate(); firmware update has been requested

  // If the reboot time is set and the current time is past the reboot time then reboot.
  if (rebootTime != 0 && now > rebootTime) {
    ESP.restart();
  }

  executeDeferredFunction(micros());

  // HandleUARTin();

  if (connectionState > MODE_STATES)
  {
    return;
  }

  CheckReadyToSend();
  CheckConfigChangePending();
  DynamicPower_Update(now);
  VtxPitmodeSwitchUpdate();
  checkSendLinkStatsToHandset(now); //uart@

  if(isRXconnected)  //after ever telemetry packet received
  {
    isRXconnected = false;
    TLMpacketReported = now;
  }

  if (DataDlReceiver.HasFinishedData())
  {
// gpio_set_level(GPIO_NUM_45, 1);
      // if (CRSFinBuffer[0] == CRSF_ADDRESS_USB)
      // {
      //   if (config.GetLinkMode() == TX_MAVLINK_MODE)
      //   {
      //     const uint8_t count = CRSFinBuffer[CRSF_TELEMETRY_LENGTH_INDEX];
      //     // Convert to CRSF telemetry where we can and send to handset
      //     convert_mavlink_to_crsf_telem(CRSF_ADDRESS_RADIO_TRANSMITTER, CRSFinBuffer, count);
      //     // forward raw mavlink data to USB
      //     TxUSB->write(CRSFinBuffer + CRSF_FRAME_NOT_COUNTED_BYTES, count);
      //     // And to the backpack if we have one
      //     if (TxUSB != BackpackOrLogStrm)
      //     {
      //       sendMAVLinkTelemetryToBackpack(CRSFinBuffer);
      //     }
      //   }
      // }
      // else
      // {
        // Send all other tlm to CRSF router
        crsfRouter.processMessage(&otaConnector, (crsf_header_t *)CRSFinBuffer);
        sendCRSFTelemetryToBackpack(CRSFinBuffer);    //MSP packet of type `MSP_ELRS_BACKPACK_CRSF_TLM`
      // }
      if (CRSFinBuffer[0] == CRSF_SYNC_BYTE)
      {
        if(CRSFinBuffer[2] == CRSF_FRAMETYPE_BATTERY_SENSOR)
        {
          airBat_Val = CRSFinBuffer[4];
        }
        else if(CRSFinBuffer[2] == CRSF_FRAMETYPE_FLIGHT_MODE)
        {
          for(uint8_t i = 0; i < (CRSFinBuffer[1] - 2); ++i)
          {
            flightMode[i] = CRSFinBuffer[i + 3];
          }
        }
        else if(CRSFinBuffer[2] == CRSF_FRAMETYPE_GPS)
        {
          latitude = 0;
          latitude = ((int32_t)CRSFinBuffer[3] << 24);
          latitude |= ((int32_t)CRSFinBuffer[4] << 16);
          latitude |= ((int32_t)CRSFinBuffer[5] << 8);
          latitude |= ((int32_t)CRSFinBuffer[6]);

          longitude = 0;
          longitude = ((int32_t)CRSFinBuffer[7] << 24);
          longitude |= ((int32_t)CRSFinBuffer[8] << 16);
          longitude |= ((int32_t)CRSFinBuffer[9] << 8);
          longitude |= ((int32_t)CRSFinBuffer[10]);

          speed = (((int16_t)CRSFinBuffer[11] << 8) + (int16_t)CRSFinBuffer[12]);
          //int16_t ground course 13, 14; uint16_t GPS altitude 15, 16
          sats = CRSFinBuffer[17];
        }
      }
      DataDlReceiver.Unlock();
//      gpio_set_level(GPIO_NUM_45, 0);
  }

  if ((now - TLMpacketReported) > 3000)   //RX_CONNECTION_LOST_TIMEOUT)
  {
    airBat_Val = 0;
    memset(flightMode, 0, 8);
    latitude = 0;
    longitude = 0;
    speed = 0;
    sats = 0;
  }

  // only send Uplink data when binding is not active
  if (InBindingMode)
  {
#if defined(RADIO_LR1121)
    // Send half of the bind packets on the 2.4GHz domain
    if (BindingSendCount == BindingSpamAmount / 2) {
      SetRFLinkRate(enumRatetoIndex(RATE_DUALBAND_BINDING));
      // Increment BindingSendCount so that SetRFLinkRate is only called once.
      BindingSendCount++;
    }
#endif
    // exit bind mode if package after some repeats
    if (BindingSendCount > BindingSpamAmount) {
      ExitBindingMode();
    }
  }
  else if (!DataUlSender.IsActive())
  {
    //my@ model match state changed locally in config.cpp/TxConfig::SetModelMatch_ST/VL
    if(modelChanged) 
    {
      modelChanged = false;
      modelMatchToMsp();    //defined in lib/VTX/devVTX. file
    }

    otaConnector.pumpSender();
  }
}
